In [1]:
import xlrd
import pandas as pd
import numpy as pd

In [2]:
import os
files_05 = os.listdir('./데이터/202205_시내')
files_06 = os.listdir('./데이터/202206_시내')

In [18]:
df_05 = pd.DataFrame()

for i in files_05 :
    data = pd.read_excel('./데이터/202205_시내/' + i, header = 1)
    data['날짜'] = i.split('_')[1]
    df_05 = pd.concat([df_05, data])

In [19]:
df_06 = pd.DataFrame()

for i in files_06 :
    data = pd.read_excel('./데이터/202206_시내/' + i, header = 1)
    data['날짜'] = i.split('_')[1]
    df_06 = pd.concat([df_06, data])

In [20]:
df = pd.concat([df_05, df_06])

In [21]:
df_use = df[['정류장코드', '정류장명', '승차합계', '하차합계', '날짜']]
df_use.head(3)

     정류장코드       정류장명       승차합계     하차합계        날짜
0       합계         합계  1,174,516  470,049  20220517
1  2620843  연제공용버스차고지         48        0  20220517
2  2609878     개인택시조합          0        0  20220517

In [22]:
index = df_use[df_use['정류장코드'] == '합계'].index
df_use = df_use.drop(index)

In [29]:
df_use['승차합계'] = pd.to_numeric(df_use['승차합계'])
df_use['하차합계'] = pd.to_numeric(df_use['하차합계'])

In [61]:
df_group = df_use.groupby(['정류장코드', '정류장명', '날짜'], as_index = False).sum()
df_group

          정류장코드          정류장명        날짜  승차합계  하차합계
0       2600002           다대포  20220501   303    54
1       2600002           다대포  20220502   240    52
2       2600002           다대포  20220503   222    30
3       2600002           다대포  20220504   231    47
4       2600002           다대포  20220505   207    28
...         ...           ...       ...   ...   ...
253464  2621919  연제도서관입구.연산더?  20220627   198   104
253465  2621919  연제도서관입구.연산더?  20220628   206    97
253466  2621919  연제도서관입구.연산더?  20220629   197   123
253467  2621919  연제도서관입구.연산더?  20220630   272   112
253468  2621920        만덕초등학교  20220630    10     6

[253469 rows x 5 columns]

In [70]:
df_group['날짜'] = pd.to_datetime(df_group['날짜'], format = '%Y-%m-%d')
df_group

          정류장코드          정류장명         날짜  승차합계  하차합계
0       2600002           다대포 2022-05-01   303    54
1       2600002           다대포 2022-05-02   240    52
2       2600002           다대포 2022-05-03   222    30
3       2600002           다대포 2022-05-04   231    47
4       2600002           다대포 2022-05-05   207    28
...         ...           ...        ...   ...   ...
253464  2621919  연제도서관입구.연산더? 2022-06-27   198   104
253465  2621919  연제도서관입구.연산더? 2022-06-28   206    97
253466  2621919  연제도서관입구.연산더? 2022-06-29   197   123
253467  2621919  연제도서관입구.연산더? 2022-06-30   272   112
253468  2621920        만덕초등학교 2022-06-30    10     6

[253469 rows x 5 columns]

In [77]:
df_final = df_group.groupby(['정류장코드', '정류장명']).resample(rule = '1W', on = '날짜').mean()
df_final

                                       승차합계        하차합계
정류장코드   정류장명         날짜
2600002 다대포          2022-05-01  303.000000   54.000000
                     2022-05-08  225.285714   35.000000
                     2022-05-15  251.000000   38.857143
                     2022-05-22  245.142857   38.714286
                     2022-05-29  284.285714   65.428571
...                                     ...         ...
2621919 연제도서관입구.연산더? 2022-06-12  201.571429   94.285714
                     2022-06-19  209.714286   98.142857
                     2022-06-26  221.714286  103.571429
                     2022-07-03  218.250000  109.000000
2621920 만덕초등학교       2022-07-03   10.000000    6.000000

[41572 rows x 2 columns]